zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT700/MIMXRT758S/MIMXRT758S_cm33_core1_COMMON.h
/* LP_FLEXCOMM - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral LP_FLEXCOMM17 base address */
  #define LP_FLEXCOMM17_BASE                       (0x50326000u)
  /** Peripheral LP_FLEXCOMM17 base address */
  #define LP_FLEXCOMM17_BASE_NS                    (0x40326000u)
  /** Peripheral LP_FLEXCOMM17 base pointer */
  #define LP_FLEXCOMM17                            ((LP_FLEXCOMM_Type *)LP_FLEXCOMM17_BASE)
  /** Peripheral LP_FLEXCOMM17 base pointer */
  #define LP_FLEXCOMM17_NS                         ((LP_FLEXCOMM_Type *)LP_FLEXCOMM17_BASE_NS)
  /** Peripheral LP_FLEXCOMM18 base address */
  #define LP_FLEXCOMM18_BASE                       (0x50327000u)
  /** Peripheral LP_FLEXCOMM18 base address */
  #define LP_FLEXCOMM18_BASE_NS                    (0x40327000u)
  /** Peripheral LP_FLEXCOMM18 base pointer */
  #define LP_FLEXCOMM18                            ((LP_FLEXCOMM_Type *)LP_FLEXCOMM18_BASE)
  /** Peripheral LP_FLEXCOMM18 base pointer */
  #define LP_FLEXCOMM18_NS                         ((LP_FLEXCOMM_Type *)LP_FLEXCOMM18_BASE_NS)
  /** Peripheral LP_FLEXCOMM19 base address */
  #define LP_FLEXCOMM19_BASE                       (0x50328000u)
  /** Peripheral LP_FLEXCOMM19 base address */
  #define LP_FLEXCOMM19_BASE_NS                    (0x40328000u)
  /** Peripheral LP_FLEXCOMM19 base pointer */
  #define LP_FLEXCOMM19                            ((LP_FLEXCOMM_Type *)LP_FLEXCOMM19_BASE)
  /** Peripheral LP_FLEXCOMM19 base pointer */
  #define LP_FLEXCOMM19_NS                         ((LP_FLEXCOMM_Type *)LP_FLEXCOMM19_BASE_NS)
  /** Peripheral LP_FLEXCOMM20 base address */
  #define LP_FLEXCOMM20_BASE                       (0x50329000u)
  /** Peripheral LP_FLEXCOMM20 base address */
  #define LP_FLEXCOMM20_BASE_NS                    (0x40329000u)
  /** Peripheral LP_FLEXCOMM20 base pointer */
  #define LP_FLEXCOMM20                            ((LP_FLEXCOMM_Type *)LP_FLEXCOMM20_BASE)
  /** Peripheral LP_FLEXCOMM20 base pointer */
  #define LP_FLEXCOMM20_NS                         ((LP_FLEXCOMM_Type *)LP_FLEXCOMM20_BASE_NS)
  /** Array initializer of LP_FLEXCOMM peripheral base addresses */
  #define LP_FLEXCOMM_BASE_ADDRS                   { 0u, 0u, 0u, 0u, 0u, 0u, 0u, 0u, 0u, 0u, 0u, 0u, 0u, 0u, 0u, 0u, 0u, LP_FLEXCOMM17_BASE, LP_FLEXCOMM18_BASE, LP_FLEXCOMM19_BASE, LP_FLEXCOMM20_BASE }
  /** Array initializer of LP_FLEXCOMM peripheral base pointers */
  #define LP_FLEXCOMM_BASE_PTRS                    { (LP_FLEXCOMM_Type *)0u, (LP_FLEXCOMM_Type *)0u, (LP_FLEXCOMM_Type *)0u, (LP_FLEXCOMM_Type *)0u, (LP_FLEXCOMM_Type *)0u, (LP_FLEXCOMM_Type *)0u, (LP_FLEXCOMM_Type *)0u, (LP_FLEXCOMM_Type *)0u, (LP_FLEXCOMM_Type *)0u, (LP_FLEXCOMM_Type *)0u, (LP_FLEXCOMM_Type *)0u, (LP_FLEXCOMM_Type *)0u, (LP_FLEXCOMM_Type *)0u, (LP_FLEXCOMM_Type *)0u, (LP_FLEXCOMM_Type *)0u, (LP_FLEXCOMM_Type *)0u, (LP_FLEXCOMM_Type *)0u, LP_FLEXCOMM17, LP_FLEXCOMM18, LP_FLEXCOMM19, LP_FLEXCOMM20 }
  /** Array initializer of LP_FLEXCOMM peripheral base addresses */
  #define LP_FLEXCOMM_BASE_ADDRS_NS                { 0u, 0u, 0u, 0u, 0u, 0u, 0u, 0u, 0u, 0u, 0u, 0u, 0u, 0u, 0u, 0u, 0u, LP_FLEXCOMM17_BASE_NS, LP_FLEXCOMM18_BASE_NS, LP_FLEXCOMM19_BASE_NS, LP_FLEXCOMM20_BASE_NS }
  /** Array initializer of LP_FLEXCOMM peripheral base pointers */
  #define LP_FLEXCOMM_BASE_PTRS_NS                 { (LP_FLEXCOMM_Type *)0u, (LP_FLEXCOMM_Type *)0u, (LP_FLEXCOMM_Type *)0u, (LP_FLEXCOMM_Type *)0u, (LP_FLEXCOMM_Type *)0u, (LP_FLEXCOMM_Type *)0u, (LP_FLEXCOMM_Type *)0u, (LP_FLEXCOMM_Type *)0u, (LP_FLEXCOMM_Type *)0u, (LP_FLEXCOMM_Type *)0u, (LP_FLEXCOMM_Type *)0u, (LP_FLEXCOMM_Type *)0u, (LP_FLEXCOMM_Type *)0u, (LP_FLEXCOMM_Type *)0u, (LP_FLEXCOMM_Type *)0u, (LP_FLEXCOMM_Type *)0u, (LP_FLEXCOMM_Type *)0u, LP_FLEXCOMM17_NS, LP_FLEXCOMM18_NS, LP_FLEXCOMM19_NS, LP_FLEXCOMM20_NS }
#else
  /** Peripheral LP_FLEXCOMM17 base address */
  #define LP_FLEXCOMM17_BASE                       (0x40326000u)
  /** Peripheral LP_FLEXCOMM17 base pointer */
  #define LP_FLEXCOMM17                            ((LP_FLEXCOMM_Type *)LP_FLEXCOMM17_BASE)
  /** Peripheral LP_FLEXCOMM18 base address */
  #define LP_FLEXCOMM18_BASE                       (0x40327000u)
  /** Peripheral LP_FLEXCOMM18 base pointer */
  #define LP_FLEXCOMM18                            ((LP_FLEXCOMM_Type *)LP_FLEXCOMM18_BASE)
  /** Peripheral LP_FLEXCOMM19 base address */
  #define LP_FLEXCOMM19_BASE                       (0x40328000u)
  /** Peripheral LP_FLEXCOMM19 base pointer */
  #define LP_FLEXCOMM19                            ((LP_FLEXCOMM_Type *)LP_FLEXCOMM19_BASE)
  /** Peripheral LP_FLEXCOMM20 base address */
  #define LP_FLEXCOMM20_BASE                       (0x40329000u)
  /** Peripheral LP_FLEXCOMM20 base pointer */
  #define LP_FLEXCOMM20                            ((LP_FLEXCOMM_Type *)LP_FLEXCOMM20_BASE)
  /** Array initializer of LP_FLEXCOMM peripheral base addresses */
  #define LP_FLEXCOMM_BASE_ADDRS                   { 0u, 0u, 0u, 0u, 0u, 0u, 0u, 0u, 0u, 0u, 0u, 0u, 0u, 0u, 0u, 0u, 0u, LP_FLEXCOMM17_BASE, LP_FLEXCOMM18_BASE, LP_FLEXCOMM19_BASE, LP_FLEXCOMM20_BASE }
  /** Array initializer of LP_FLEXCOMM peripheral base pointers */
  #define LP_FLEXCOMM_BASE_PTRS                    { (LP_FLEXCOMM_Type *)0u, (LP_FLEXCOMM_Type *)0u, (LP_FLEXCOMM_Type *)0u, (LP_FLEXCOMM_Type *)0u, (LP_FLEXCOMM_Type *)0u, (LP_FLEXCOMM_Type *)0u, (LP_FLEXCOMM_Type *)0u, (LP_FLEXCOMM_Type *)0u, (LP_FLEXCOMM_Type *)0u, (LP_FLEXCOMM_Type *)0u, (LP_FLEXCOMM_Type *)0u, (LP_FLEXCOMM_Type *)0u, (LP_FLEXCOMM_Type *)0u, (LP_FLEXCOMM_Type *)0u, (LP_FLEXCOMM_Type *)0u, (LP_FLEXCOMM_Type *)0u, (LP_FLEXCOMM_Type *)0u, LP_FLEXCOMM17, LP_FLEXCOMM18, LP_FLEXCOMM19, LP_FLEXCOMM20 }
#endif
/** Interrupt vectors for the LP_FLEXCOMM peripheral type */
#define LP_FLEXCOMM_IRQS                         { NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, NotAvail_IRQn, LP_FLEXCOMM17_IRQn, LP_FLEXCOMM18_IRQn, LP_FLEXCOMM19_IRQn, LP_FLEXCOMM20_IRQn }

